In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
work_df = pd.read_csv('resources/data/unemployment-by-state.csv')

In [3]:
work_df.head()

,State,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,United States,4.6,5.8,9.3,9.6,8.9,8.1,7.4,6.2,5.3,4.9,4.4
1,Alabama,4.0,5.7,11.0,10.5,9.6,8.0,7.2,6.8,6.1,5.9,4.4
2,Alaska,6.3,6.7,7.7,7.9,7.6,7.1,7.0,6.9,6.5,6.9,7.2
3,Arizona,3.9,6.2,9.9,10.4,9.5,8.3,7.7,6.8,6.1,5.4,4.9
4,Arkansas,5.3,5.5,7.8,8.2,8.3,7.6,7.2,6.0,5.0,3.9,3.7

In [4]:
work_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 12 columns):
State    52 non-null object
2007     52 non-null float64
2008     52 non-null float64
2009     52 non-null float64
2010     52 non-null float64
2011     52 non-null float64
2012     52 non-null float64
2013     52 non-null float64
2014     52 non-null float64
2015     52 non-null float64
2016     52 non-null float64
2017     52 non-null float64
dtypes: float64(11), object(1)
memory usage: 5.0+ KB

In [5]:
work_df.State.unique()

array(['United States', 'Alabama', 'Alaska', 'Arizona', 'Arkansas',
       'California', 'Colorado', 'Connecticut', 'Delaware',
       'District of Columbia', 'Florida', 'Georgia', 'Hawaii', 'Idaho',
       'Illinois', 'Indiana', 'Iowa', 'Kansas', 'Kentucky', 'Louisiana',
       'Maine', 'Maryland', 'Massachusetts', 'Michigan', 'Minnesota',
       'Mississippi', 'Missouri', 'Montana', 'Nebraska', 'Nevada',
       'New Hampshire', 'New Jersey', 'New Mexico', 'New York',
       'North Carolina', 'North Dakota', 'Ohio', 'Oklahoma', 'Oregon',
       'Pennsylvania', 'Rhode Island', 'South Carolina', 'South Dakota',
       'Tennessee', 'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [6]:
work_df.query('State == "District of Columbia"')

,State,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
9,District of Columbia,5.5,6.5,9.3,9.4,10.2,9.0,8.5,7.8,6.9,6.1,6.1

Drop unnecessary state names

In [7]:
work_df.drop([0, 9], axis=0, inplace=True)

In [8]:
work_df.shape

(50, 12)

Convert to long format

In [9]:
work_df = pd.melt(work_df, 
        id_vars='State', 
        value_vars=['2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017'], 
        var_name='year', 
        value_name='unemployment')

In [10]:
work_df.head()

        State  year  unemployment
0     Alabama  2007           4.0
1      Alaska  2007           6.3
2     Arizona  2007           3.9
3    Arkansas  2007           5.3
4  California  2007           5.4

Change to lower case column names

In [11]:
cols = ['state', 'year', 'unemployment']
work_df.columns = cols

In [12]:
work_df.head()

        state  year  unemployment
0     Alabama  2007           4.0
1      Alaska  2007           6.3
2     Arizona  2007           3.9
3    Arkansas  2007           5.3
4  California  2007           5.4

In [13]:
work_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550 entries, 0 to 549
Data columns (total 3 columns):
state           550 non-null object
year            550 non-null object
unemployment    550 non-null float64
dtypes: float64(1), object(2)
memory usage: 13.0+ KB

In [14]:
work_df.to_csv('datasets/unemployment.csv')